/**---------------------------------------------------------------------------
 *   @file        usb4_HIA.cpp
 *
 *   @brief   Implements host interface adapter
 *
 *   Copyright (c) 2019-2020 Qualcomm Technologies Incorporated.
 *   All Rights Reserved.
 *   Qualcomm Confidential and Proprietary
 *--------------------------------------------------------------------------*/

/* --------------------------------------------------------------------------
 * Includes
 *--------------------------------------------------------------------------*/
#include <Usb4Utils.h>
#include <Usb4Log.h>

// #include "VVHAL_usb4_logger.h"  // Logging utilities
// #include "VVHAL_usb4_timer.h"
// #include "VVHAL_usb4_utils.h"
#include "HALhwio.h"

#include "usb4_mem.h"
#include "usb4_hwio.h"    /* in_dword, out_dword for ISR regs */
#include "usb4_frames_seg_calc.h"

#include "usb4_HIA.h"

/* --------------------------------------------------------------------------
 * Macros / Types
 *--------------------------------------------------------------------------*/
/** @brief helper for more readabilty mappings */
#define IO_ADDR(base, offset)   ((UINT32*)((UINT8*)(base) + offset))

/** @brief ISR addres offset based on the USB4 spec */
#define IO_ISR_ADDR(base)   IO_ADDR(base, 0x37800)

/** @brief ISC addres offset based on the USB4 spec */
#define IO_ISC_ADDR(base)   IO_ADDR(base, 0x37808)

/** @brief ISS addres offset based on the USB4 spec */
#define IO_ISS_ADDR(base)   IO_ADDR(base, 0x37810)

/** @brief IMR addres offset based on the USB4 spec */
#define IO_IMR_ADDR(base)   IO_ADDR(base, 0x38200)

/** @brief IMC addres offset based on the USB4 spec */
#define IO_IMC_ADDR(base)   IO_ADDR(base, 0x38208)

/** @brief IMS addres offset based on the USB4 spec */
#define IO_IMS_ADDR(base)   IO_ADDR(base, 0x38210)

/* --------------------------------------------------------------------------
 * Static Variables
 *--------------------------------------------------------------------------*/
#pragma pack(push)
#pragma pack(1)

/** @brief USB4 1.0 - Figure 12-4 */
typedef union
{
  struct
  {
    // dword0
    UINT32 addr_low         : 32;

    // dword1
    UINT32 addr_high        : 32;

    // dword2
    UINT32 data_length      : 12;       // 0:11
    UINT32 eof_pdf          :  4;       // 12:15
    UINT32 sof_pdf          :  4;       // 16:19
    UINT32 reserved_0       :  1;       // 20
    UINT32 descriptor_done  :  1;       // 21
    UINT32 request_status   :  1;       // 22
    UINT32 interrupt_enable :  1;       // 23
    UINT32 offset           :  8;       // 24:31

    // dword3
    UINT32 reserved_1       : 32;
  } transmit_fields;
  UINT8 raw[16];
} USB4_hi_trasmit_desc;

/** @brief USB4 1.0 - Figure 12-5 */
typedef union
{
  struct
  {
    // dword0
    UINT32 addr_low         : 32;

    // dword1
    UINT32 addr_high        : 32;

    // dword2
    UINT32 reserved_0       : 21;       // 0:20
    UINT32 descriptor_done  :  1;       // 21
    UINT32 request_status   :  1;       // 22
    UINT32 interrupt_enable :  1;       // 23
    UINT32 offset           :  8;       // 24:31

    // dword3
    UINT32 reserved_1       : 32;
  } receive_fields;
  UINT8 raw[32];
} USB4_hi_recieve_hia_desc;

/** @brief USB4 1.0 - Figure 12-6 */
typedef union
{
  struct
  {
    // dword0
    UINT32 addr_low         : 32;

    // dword1
    UINT32 addr_high        : 32;

    // dword2
    UINT32 data_length      : 12;       // 0:11
    UINT32 eof_pdf          :  4;       // 12:15
    UINT32 sof_pdf          :  4;       // 16:19
    UINT32 crc_error        :  1;       // 20
    UINT32 descriptor_done  :  1;       // 21
    UINT32 buffer_overflow  :  1;       // 22
    UINT32 interrupt_enable :  1;       // 23
    UINT32 offset           :  8;       // 24:31

    // dword3
    UINT32 reserved_1       : 32;
  } receive_host_fields;
  UINT8 raw[32];
} USB4_hi_recieve_host_desc;

#pragma pack(pop)

/* --------------------------------------------------------------------------
 * Global Variables
 *--------------------------------------------------------------------------*/

/* --------------------------------------------------------------------------
 * Static Functions
 *--------------------------------------------------------------------------*/

/* --------------------------------------------------------------------------
 * Global Functions
 *--------------------------------------------------------------------------*/

int Usb4HiaInit(usb4_hia_ctx_t* hia_ctx, UINT8* pModuleBaseAddr)
{
  UINT32 i;

  hia_ctx->m_pModuleBaseAddr = NULL;
  hia_ctx->m_pSlots = NULL;
  hia_ctx->m_num_slots = 0;
  hia_ctx->m_interrupt_status = 0;
